# Nurbs Surface Data Get Number Of Weights Method

Source: https://www.revitapidocs.com/2026/8134d0dc-0e26-1346-fefa-3a378a61329f.htm

---

| Nurbs Surface Data Get Number Of Weights Method |
| --- |

Get the number of weights.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int GetNumberOfWeights()
```

```
Public Function GetNumberOfWeights As Integer
```

```
public:
int GetNumberOfWeights()
```

```
member GetNumberOfWeights : unit -> int
```

#### Return Value

Int32 See Also

#### Reference

NurbsSurfaceData Class Autodesk.Revit.DB Namespace